tap "aws/tap"
tap "bazelbuild/tap"
tap "blackfireio/blackfire"
tap "browsh-org/browsh"
tap "buo/cask-upgrade"
tap "crisidev/chunkwm"
tap "eugenmayer/dockersync"
tap "golangci/tap"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "kabel/php-ext"
tap "koekeishiya/formulae"
tap "osx-cross/avr"
tap "px4/px4"
tap "railwaycat/emacsmacport"
tap "reactiveops/tap"
tap "rs/tap"
tap "salesforce/cloudsplaining", "https://github.com/salesforce/cloudsplaining"
tap "versent/taps"
tap "warrensbox/tap"
cask "adoptopenjdk8"
cask "osxfuse"
cask "xquartz"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: false
# Portable Foreign Function Interface library
brew "libffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Java build tool
brew "ant"
# GNOME accessibility toolkit
brew "atk"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Library for USB device access
brew "libusb"
# Atmel AVR MCU programmer
brew "avrdude"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Implementation of the DNS protocols
brew "bind"
# Interface bandwidth monitor
brew "bmon"
# Collection of portable C++ source libraries
brew "boost"
# BSD make (build tool)
brew "bsdmake"
# Console-based live network and disk I/O bandwidth monitor
brew "bwm-ng"
# Asynchronous DNS library
brew "c-ares"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# Tiling window manager for macOS based on plugin architecture
brew "chunkwm"
# Command-line tool for Amazon Route 53
brew "cli53"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# Tool for service discovery, monitoring and configuration
brew "consul"
# Convert a Container Linux Config into Ignition
brew "coreos-ct"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Asynchronous event library
brew "libev"
# Asynchronous event library
brew "libevent"
# International domain name library
brew "libidn"
# C library implementing the SSH2 protocol
brew "libssh2"
# HTTP/2 C Library
brew "nghttp2"
# Compiler for writing C extensions for the Python language
brew "cython"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# USB programmer
brew "dfu-util"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Docker Machine driver for hyperkit
brew "docker-machine-driver-hyperkit"
# A tool for developers to create cloud-native applications on Kubernetes.
brew "draft"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GNU multiple precision arithmetic library
brew "gmp"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# GNU Emacs text editor
brew "emacs", link: false
# Modern replacement for 'ls'
brew "exa"
# Ogg Bitstream Library
brew "libogg"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# VP8/VP9 video codec
brew "libvpx"
# Audio codec
brew "opus"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Toolkit for developing Graphical User Interfaces easily
brew "fox"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Google Drive CLI Client
brew "gdrive"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# SASL library command-line interface
brew "gsasl"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Implementation of the file(1) command
brew "libmagic"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# C library to parse flash media stream properties
brew "libquvi"
# Python 2 bindings for the Cairo graphics library
brew "py2cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Parse video download URLs
brew "quvi"
# Interactive viewer for graphs written in Graphviz's dot language
brew "xdot"
# Manage files with git without checking in file contents
brew "git-annex"
# Git extension for versioning large files
brew "git-lfs"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Compute various size metrics for a Git repository
brew "git-sizer"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Filter IP addresses matching IPv4 CIDR/network specification
brew "grepcidr"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Java-based scripting language
brew "groovy"
# Development framework for multimedia applications
brew "gstreamer"
# GStreamer plugins (well-supported, basic set)
brew "gst-plugins-base"
# GStreamer plugins for Libav (a fork of FFmpeg)
brew "gst-libav"
# GStreamer plugins less supported, not fully tested
brew "gst-plugins-bad"
# GStreamer plugins (well-supported, under the LGPL)
brew "gst-plugins-good"
# GUI toolkit
brew "gtk+"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# The Kubernetes package manager
brew "helm"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# Tool to report network interface bandwidth
brew "ifstat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# University of Washington IMAP toolkit
brew "imap-uw"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Json incremental digger
brew "jid"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# JSON parser and validator with a CLI
brew "jsonlint"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# DNS library written in C
brew "ldns"
# Sophisticated file transfer program
brew "lftp"
# Audio and video processing tools
brew "libav"
# GNOME XML library
brew "libxml2"
# C and C++ client library to the memcached server
brew "libmemcached"
# Library for MPD in the C, C++, and Objective-C languages
brew "libmpdclient"
# Library for SVG files
brew "libsvg"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# YAML Parser
brew "libyaml"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Uniform interface to a large number of hash algorithms
brew "mhash"
# Replacement for the old crypt package and crypt(1) command
brew "mcrypt"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Cross platform, open source .NET development framework
brew "mono"
# Improved JPEG encoder
brew "mozjpeg"
# Multiple Repository management tool
brew "mr"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Port scanning utility for large networks
brew "nmap"
# Kubernetes introspection tool for developers
brew "octant"
# Open Fortinet client for PPP+SSL VPN tunnel services
brew "openfortivpn"
# H.264 codec from Cisco
brew "openh264"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php", restart_service: true
# General-purpose scripting language
brew "php@7.2", restart_service: true
# PNG image optimizing utility
brew "pngquant"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Object-relational database system
brew "postgresql@11"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# GLib/GObject/GIO Python bindings for Python 2
brew "pygobject"
# GTK+ bindings for Python
brew "pygtk"
# Treat text as a database
brew "q"
# RabbitMQ C client
brew "rabbitmq-c"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# The Rust toolchain installer
brew "rustup-init"
# Generate passwords using SecurityFoundation framework
brew "sf-pwgen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Version control system designed to be a better CVS
brew "subversion"
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Convert TeXinfo files to HTML
brew "texi2html"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Ultimate terminal divider powered by tmux
brew "tmux-xpanes"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# File synchronization tool for OSX
brew "unison"
# Extraction utility for .zip compressed archives
brew "unzip"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Config manager based on git
brew "vcsh"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# Fast CSV toolkit written in Rust
brew "xsv"
# Yet Another JSON Library
brew "yajl"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl", link: false
# Compression and file packaging/archive utility
brew "zip"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Fast, scalable, multi-language and extensible build system
brew "bazelbuild/tap/bazel"
# Tool for building Bazel targets when source files change
brew "bazelbuild/tap/ibazel"
brew "blackfireio/blackfire/blackfire-agent"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# A layer for unison-fsmonitor arround either macfsevents or watchdog for usage with unison
brew "eugenmayer/dockersync/unox"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Test your configuration using Open Policy Agent
brew "instrumenta/instrumenta/conftest"
# Validate your Kubernetes configurations
brew "instrumenta/instrumenta/kubeval"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@7", link: true
# GNU Embedded Toolchain for ARM
brew "px4/px4/gcc-arm-none-eabi"
# Open Source Best Practices for Kubernetes
brew "reactiveops/tap/polaris"
# JSON Aggregation CLI
brew "rs/tap/jaggr"
# iTerm2 expvar/JSON monitoring tool
brew "rs/tap/jplot"
# Shiny new formula
brew "salesforce/cloudsplaining/cloudsplaining"
brew "versent/taps/saml2aws"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
cask "1password-cli"
cask "adoptopenjdk"
cask "alacritty"
cask "alfred"
cask "android-platform-tools"
cask "avibrazil-rdm"
cask "bartender"
cask "blackhole"
cask "caffeine"
cask "charles"
cask "contexts"
cask "coolterm"
cask "daisydisk"
cask "dash"
cask "db-browser-for-sqlite"
cask "docker-edge"
cask "edex-ui"
cask "emacs-mac-spacemacs-icon"
cask "firefox"
cask "firefox-developer-edition"
cask "flux"
cask "font-hack-nerd-font"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "forklift"
cask "forticlient"
cask "gifrocket"
cask "gitify"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "graphiql"
cask "graphql-ide"
cask "gzdoom"
cask "horndis"
cask "iina"
cask "imageoptim"
cask "insomnia"
cask "intel-power-gadget"
cask "ioquake3"
cask "iterm2-beta"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "kap"
cask "karabiner-elements"
cask "keycastr"
cask "kiibohd-configurator"
cask "kitematic"
cask "kitty"
cask "krita"
cask "launchrocket"
cask "lulu"
cask "lumen"
cask "macvim"
cask "microsoft-edge-beta"
cask "mplayerx"
cask "mpv"
cask "muzzle"
cask "mysqlworkbench"
cask "nomad"
cask "obs"
cask "obs-virtualcam"
cask "oni"
cask "openemu-experimental"
cask "pacifist"
cask "paw"
cask "phoenix"
cask "plex-media-player"
cask "plexamp"
cask "pock"
cask "postico"
cask "postman"
cask "principle"
cask "provisionql"
cask "qlcolorcode"
cask "qlstephen"
cask "qlvideo"
cask "qmk-toolbox"
cask "reaper"
cask "resilio-sync"
cask "sequel-pro"
cask "session-manager-plugin"
cask "shortcat"
cask "sim-daltonism"
cask "sketch"
cask "slack"
cask "smcfancontrol"
cask "soundsource"
cask "spotify"
cask "station"
cask "sublime-text"
cask "suspicious-package"
cask "the-archive-browser"
cask "the-unarchiver"
cask "ubersicht"
cask "usb-overdrive"
cask "vimr"
cask "visual-studio-code"
cask "vlc"
cask "watts"
cask "wireshark"
cask "xonotic"
cask "yubico-authenticator"
cask "zerotier-one"
mas "Airmail", id: 918858936
mas "Apple Configurator 2", id: 1037126344
mas "Discovery", id: 1381004916
mas "Disk Speed Test", id: 425264550
mas "Fenêtre", id: 1286743037
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Textual IRC Client", id: 1262957439
mas "The Clock", id: 488764545
mas "tv.sienna.NDIScanConvertor", id: 1084051465
mas "Tweetbot", id: 1384080005
mas "WiFi Signal", id: 525912054
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
