tap "abridoux/formulae"
tap "adoptopenjdk/openjdk"
tap "anchore/grype"
tap "anchore/syft"
tap "aquasecurity/trivy"
tap "ariga/tap"
tap "aws/tap"
tap "aylei/tap"
tap "bazelbuild/tap"
tap "bflad/tap"
tap "browsh-org/browsh"
tap "buo/cask-upgrade"
tap "crisidev/chunkwm"
tap "danielfoehrkn/switch"
tap "eugenmayer/dockersync"
tap "fairwindsops/tap"
tap "filippo.io/age", "https://filippo.io/age"
tap "flood-io/taps"
tap "fluxcd/tap"
tap "golangci/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "iann0036/iamlive"
tap "kabel/php-ext"
tap "koekeishiya/formulae"
tap "lacework/tap"
tap "microsoft/git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "px4/px4"
tap "qmk/qmk"
tap "railwaycat/emacsmacport"
tap "rhysd/actionlint", "https://github.com/rhysd/actionlint"
tap "rs/tap"
tap "salesforce/cloudsplaining", "https://github.com/salesforce/cloudsplaining"
tap "salesforce/policy_sentry", "https://github.com/salesforce/policy_sentry"
tap "snyk/tap"
tap "stylemistake/formulae"
tap "teamookla/speedtest"
tap "versent/taps"
tap "warrensbox/tap"
tap "weaveworks/tap"
tap "xen0l/taps"
brew "act"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gdbm"
brew "gettext"
brew "pcre"
brew "glib"
brew "pkg-config"
brew "pixman"
brew "readline"
brew "xz"
brew "cairo"
brew "libtiff"
brew "gdk-pixbuf"
brew "gobject-introspection"
brew "graphite2"
brew "harfbuzz"
brew "jpeg"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "age"
brew "ansifilter"
brew "ant"
brew "webp"
brew "argocd"
brew "atk"
brew "autoconf"
brew "automake"
brew "boost"
brew "libusb"
brew "avrdude"
brew "awscli"
brew "bash"
brew "bat"
brew "gmp"
brew "coreutils"
brew "bats-core"
brew "bazel"
brew "libunistring"
brew "libidn2"
brew "libuv"
brew "bind"
brew "bmon"
brew "broot"
brew "bsdmake"
brew "bwm-ng"
brew "c-ares"
brew "ghc"
brew "cabal-install"
brew "capnp"
brew "libtool"
brew "cfssl"
brew "chunkwm"
brew "cli53"
brew "cmake"
brew "cmatrix"
brew "libssh2"
brew "curl"
brew "unixodbc"
brew "freetds"
brew "oniguruma"
brew "php", restart_service: true
brew "composer"
brew "consul"
brew "coreos-ct"
brew "cython"
brew "jasper"
brew "go"
brew "dep"
brew "dfu-programmer"
brew "dfu-util"
brew "dive"
brew "dnscontrol"
brew "docker", link: false
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "duti"
brew "eksctl"
brew "erlang"
brew "elixir"
brew "libevent"
brew "jansson"
brew "emacs", link: false
brew "exa"
brew "fd"
brew "libogg"
brew "lame"
brew "libvorbis"
brew "opus"
brew "libvpx"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "fox"
brew "fzf"
brew "gawk"
brew "isl"
brew "gdrive"
brew "geckodriver"
brew "gh"
brew "libidn"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-absorb"
brew "libmagic"
brew "git-annex"
brew "git-delta"
brew "git-lfs"
brew "git-secrets"
brew "git-sizer"
brew "gsettings-desktop-schemas"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "libmaxminddb"
brew "goaccess"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "grepcidr"
brew "gron"
brew "msgpack"
brew "groonga"
brew "groovy"
brew "gsasl"
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-libav"
brew "gst-plugins-bad"
brew "hicolor-icon-theme"
brew "gtk+3"
brew "libpsl"
brew "libsoup"
brew "gst-plugins-good"
brew "gst-plugins-ugly"
brew "gtk+"
brew "gtk-mac-integration"
brew "hadolint"
brew "hey"
brew "lua"
brew "highlight"
brew "hping"
brew "htop"
brew "httpd"
brew "httpflow"
brew "httpstat"
brew "hub"
brew "libev"
brew "hyperkit"
brew "icdiff"
brew "ifstat"
brew "imagemagick"
brew "imap-uw"
brew "infracost"
brew "ios-webkit-debug-proxy"
brew "ipcalc"
brew "iperf3"
brew "iproute2mac"
brew "jemalloc"
brew "jid"
brew "jp"
brew "jq"
brew "jsonnet"
brew "kind"
brew "knock"
brew "kubernetes-cli"
brew "kops"
brew "kustomize"
brew "perl"
brew "latexindent"
brew "ldns"
brew "less"
brew "lftp"
brew "libav"
brew "libfido2"
brew "libxml2"
brew "libmemcached"
brew "libmpdclient"
brew "lua@5.1"
brew "libquvi"
brew "libsvg"
brew "unibilium"
brew "libtermkey"
brew "libvterm"
brew "libyaml"
brew "lnav"
brew "luajit"
brew "lynx"
brew "make"
brew "mas"
brew "maven"
brew "mhash"
brew "mcrypt"
brew "media-info"
brew "miller"
brew "minikube"
brew "protobuf"
brew "mitmproxy"
brew "modd"
brew "mono"
brew "mozjpeg"
brew "mr"
brew "mtr"
brew "nasm"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nghttp2"
brew "nmap"
brew "node"
brew "nomad", link: false
brew "octant"
brew "opa"
brew "openconnect", args: ["HEAD"]
brew "openfortivpn", args: ["HEAD"]
brew "openh264"
brew "openssh"
brew "pandoc"
brew "parallel"
brew "tree"
brew "pass-otp"
brew "poppler"
brew "pdfpc"
brew "pinentry-mac"
brew "pipenv"
brew "pngpaste"
brew "pngquant"
brew "qemu"
brew "podman"
brew "popt"
brew "pre-commit"
brew "pssh"
brew "pv"
brew "pwgen"
brew "py2cairo"
brew "pygobject3"
brew "pympress"
brew "pypy"
brew "pyqt"
brew "python@3.7"
brew "q"
brew "qcachegrind"
brew "quvi"
brew "r"
brew "rabbitmq-c"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ripgrep-all"
brew "rpm"
brew "rsync"
brew "ruby"
brew "rustup-init"
brew "sf-pwgen"
brew "shellcheck"
brew "skopeo"
brew "step"
brew "stern"
brew "subversion"
brew "switchaudio-osx"
brew "tcptraceroute"
brew "telnet"
brew "terraform-docs"
brew "testssl"
brew "texi2html"
brew "texlive"
brew "tflint"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmux-xpanes"
brew "tox"
brew "unar"
brew "unison"
brew "unzip"
brew "vala"
brew "vault"
brew "vcsh"
brew "vegeta"
brew "viddy"
brew "vim"
brew "watch"
brew "wget"
brew "xdot"
brew "xmlstarlet"
brew "xsv"
brew "yajl"
brew "yarn"
brew "youtube-dl"
brew "yubico-piv-tool"
brew "yubikey-agent", restart_service: true
brew "zbar"
brew "zip"
brew "zlib"
brew "zsh"
brew "abridoux/formulae/scout"
brew "anchore/grype/grype"
brew "anchore/syft/syft"
brew "aquasecurity/trivy/trivy"
brew "ariga/tap/atlas"
brew "aws/tap/aws-sam-cli"
brew "aylei/tap/kubectl-debug"
brew "bazelbuild/tap/ibazel"
brew "browsh-org/browsh/browsh"
brew "danielfoehrkn/switch/switch"
brew "eugenmayer/dockersync/unox"
brew "flood-io/taps/element"
brew "fluxcd/tap/flux", link: false
brew "golangci/tap/golangci-lint"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform-ls"
brew "iann0036/iamlive/iamlive"
brew "koekeishiya/formulae/skhd"
brew "lacework/tap/lacework-cli"
brew "osx-cross/avr/avr-gcc@9"
brew "qmk/qmk/qmk"
brew "rhysd/actionlint/actionlint"
brew "salesforce/cloudsplaining/cloudsplaining"
brew "salesforce/policy_sentry/policy_sentry"
brew "snyk/tap/snyk"
brew "stylemistake/formulae/runner"
brew "teamookla/speedtest/speedtest"
brew "versent/taps/saml2aws"
brew "warrensbox/tap/tfswitch"
brew "xen0l/taps/aws-gate"
cask "1password-cli"
cask "adoptopenjdk"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred4"
cask "android-platform-tools"
cask "another-redis-desktop-manager"
cask "avibrazil-rdm"
cask "bartender"
cask "blackhole"
cask "caffeine"
cask "cameracontroller"
cask "charles"
cask "contexts"
cask "coolterm"
cask "creative-sb-command"
cask "daisydisk"
cask "dash"
cask "db-browser-for-sqlite"
cask "displaycal"
cask "docker-edge"
cask "edex-ui"
cask "elgato-thunderbolt-dock"
cask "eloston-chromium"
cask "emacs-mac-spacemacs-icon"
cask "firefox"
cask "firefox-developer-edition"
cask "flux"
cask "font-hack-nerd-font"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "forklift"
cask "ftdi-vcp-driver"
cask "gephi"
cask "gifrocket"
cask "git-credential-manager-core"
cask "gitify"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "graphiql"
cask "graphql-ide"
cask "gzdoom"
cask "ha-menu"
cask "horndis"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "insomnia"
cask "intel-power-gadget"
cask "ioquake3"
cask "iterm2-beta"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "kap"
cask "karabiner-elements"
cask "keycastr"
cask "kiibohd-configurator"
cask "kitematic"
cask "kitty"
cask "krita"
cask "launchrocket"
cask "lulu"
cask "lumen"
cask "lunar"
cask "macvim"
cask "microsoft-auto-update"
cask "microsoft-edge-beta"
cask "modern-csv"
cask "monitorcontrol"
cask "mplayerx"
cask "mpv"
cask "mtmr"
cask "muzzle"
cask "mysqlworkbench"
cask "nativedisplaybrightness"
cask "nomad"
cask "nosql-workbench-for-amazon-dynamodb"
cask "obs"
cask "obs-virtualcam"
cask "oni"
cask "openconnect-gui"
cask "openemu-experimental"
cask "osxfuse"
cask "pacifist"
cask "paw"
cask "phoenix"
cask "plex-media-player"
cask "plexamp"
cask "pock"
cask "postico"
cask "postman"
cask "provisionql"
cask "qlcolorcode"
cask "qlstephen"
cask "qlvideo"
cask "qmk-toolbox"
cask "raycast"
cask "razorsql"
cask "reaper"
cask "rstudio-preview"
cask "secretive"
cask "sequel-pro"
cask "session-manager-plugin"
cask "shortcat"
cask "sim-daltonism"
cask "sketch"
cask "slack"
cask "smcfancontrol"
cask "soundsource"
cask "spotify"
cask "station"
cask "sublime-text"
cask "suspicious-package"
cask "the-archive-browser"
cask "the-unarchiver"
cask "ubersicht"
cask "usb-overdrive"
cask "utm"
cask "vimr"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "watts"
cask "wireshark"
cask "xquartz"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
mas "1Password for Safari", id: 1569813296
mas "Airmail", id: 918858936
mas "AmorphousMemoryMark", id: 1495719766
mas "Apple Configurator", id: 1037126344
mas "CleanMyDrive 2", id: 523620159
mas "Discovery", id: 1381004916
mas "Disk Speed Test", id: 425264550
mas "Fenêtre", id: 1286743037
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "Home Assistant", id: 1099568401
mas "Keynote", id: 409183694
mas "Levelator", id: 1493326487
mas "Microsoft Remote Desktop", id: 1295203466
mas "NDIScanConverter", id: 1084051465
mas "Next Meeting", id: 1017470484
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Textual IRC Client", id: 1262957439
mas "The Clock", id: 488764545
mas "Tweetbot", id: 1384080005
mas "WiFi Signal", id: 525912054
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
