tap "abridoux/formulae"
tap "adoptopenjdk/openjdk"
tap "anchore/grype"
tap "anchore/syft"
tap "aquasecurity/trivy"
tap "ariga/tap"
tap "atomicjar/tap"
tap "aws/tap"
tap "aylei/tap"
tap "bazelbuild/tap"
tap "benbjohnson/litestream"
tap "benweint/gquil", "https://github.com/benweint/gquil"
tap "bflad/tap"
tap "browsh-org/browsh"
tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "busser/tap"
tap "charmbracelet/tap"
tap "cormacrelf/tap"
tap "crisidev/chunkwm"
tap "cyclonedx/cyclonedx"
tap "d12frosted/emacs-plus"
tap "danielfoehrkn/switch"
tap "dashlane/tap"
tap "daveshanley/vacuum"
tap "fairwindsops/tap"
tap "fastly/tap"
tap "filippo.io/age", "https://filippo.io/age"
tap "fluxcd/tap"
tap "gabotechs/taps"
tap "garethgeorge/backrest-tap"
tap "go-gremlins/tap"
tap "golangci/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "homeport/tap"
tap "iann0036/iamlive"
tap "im2nguyen/envo"
tap "joerdav/xc"
tap "k1low/tap"
tap "kabel/php-ext"
tap "kcl-lang/tap"
tap "koekeishiya/formulae"
tap "kubeshop/tracetest"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
tap "llimllib/whisper"
tap "microsoft/git"
tap "minio/stable"
tap "nicholasdille/tap"
tap "nikitabobko/tap"
tap "noborus/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "peak/tap"
tap "pkgxdev/made"
tap "px4/px4"
tap "qmk/qmk"
tap "railwaycat/emacsmacport"
tap "rs/tap"
tap "salesforce/cloudsplaining", "https://github.com/salesforce/cloudsplaining"
tap "salesforce/policy_sentry", "https://github.com/salesforce/policy_sentry"
tap "stateful/tap"
tap "stylemistake/formulae"
tap "teamookla/speedtest"
tap "terraform-docs/tap"
tap "tinted-theming/tinted"
tap "tylerbrock/saw"
tap "versent/taps"
tap "wader/tap"
tap "warrensbox/tap"
tap "weaveworks/tap"
tap "xen0l/taps"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# TIFF library and utilities
brew "libtiff"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Simple, modern, secure file encryption
brew "age"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# Library for USB device access
brew "libusb"
# Atmel AVR MCU programmer
brew "avrdude"
# YAML Parser
brew "libyaml"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# User-friendly launcher for Bazel
brew "bazelisk"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Implementation of the DNS protocols
brew "bind"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Interface bandwidth monitor
brew "bmon"
# New way to see and navigate directory trees
brew "broot"
# BSD version of the Make build tool
brew "bsdmake"
# Concurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Console-based live network and disk I/O bandwidth monitor
brew "bwm-ng"
# Asynchronous DNS library
brew "c-ares"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Data interchange format and capability-based RPC system
brew "capnp"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# Command-line tool for Amazon Route 53
brew "cli53"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Utility that creates projects from templates
brew "cookiecutter"
# Compiler for writing C extensions for the Python language
brew "cython"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# OWASP dependency-check
brew "dependency-check"
# Enterprise friendly way of detecting and preventing secrets in code
brew "detect-secrets"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# USB programmer
brew "dfu-util"
# Tool for exploring each layer in a docker image
brew "dive"
# Synchronize your DNS to multiple providers from a simple DSL
brew "dnscontrol"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Detect, track and alert on infrastructure drift
brew "driftctl"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Friendly and expressive shell
brew "elvish"
# Extremely fast JavaScript bundler and minifier
brew "esbuild"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ogg Bitstream Library
brew "libogg"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Vorbis general audio compression codec
brew "libvorbis"
# Audio codec
brew "opus"
# VP8/VP9 video codec
brew "libvpx"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Next-gen compiler infrastructure
brew "llvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Toolkit for developing Graphical User Interfaces easily
brew "fox"
# Platform built on V8 to build network applications
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Integer Set Library for the polyhedral model
brew "isl"
# Google Drive CLI Client
brew "gdrive"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Implementation of the file(1) command
brew "libmagic"
# Manage files with git without checking in file contents
brew "git-annex"
# Highly customizable changelog generator
brew "git-cliff"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alias for git commit --fixup <ref>
brew "git-fixup"
# Git extension for versioning large files
brew "git-lfs"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Compute various size metrics for a Git repository
brew "git-sizer"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Render markdown on the CLI
brew "glow"
# Reverse tethering tool for Android
brew "gnirehtet"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Filter IP addresses matching IPv4 CIDR/network specification
brew "grepcidr"
# Make JSON greppable
brew "gron"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Fulltext search engine and column store
brew "groonga"
# Java-based scripting language
brew "groovy"
# Interactive web UI for gRPC, along the lines of postman
brew "grpcui"
# Like cURL, but for gRPC
brew "grpcurl"
# SASL library command-line interface
brew "gsasl"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Flexible data modeling & code generation system
brew "hof"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Perl compatible regular expressions library
brew "pcre"
# Packet capture and analysis utility similar to tcpdump for HTTP
brew "httpflow"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Improved colored diff
brew "icdiff"
# Tool to report network interface bandwidth
brew "ifstat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Read your tfstate or HCL to generate a graph
brew "inframap"
# DevTools proxy for iOS devices
brew "ios-webkit-debug-proxy"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Istio configuration command-line utility
brew "istioctl"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Json incremental digger
brew "jid"
# Git-compatible distributed version control system
brew "jj"
# Dead simple terminal plots from JSON data
brew "jp"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Handy way to save and run project-specific commands
brew "just"
# Run local Kubernetes cluster in Docker
brew "kind"
# Port-knock server
brew "knock"
# Build and deploy Go applications on Kubernetes
brew "ko"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Package manager for kubectl plugins
brew "krew"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Highly capable, feature-rich programming language
brew "perl"
# Add indentation to LaTeX files
brew "latexindent"
# DNS library written in C
brew "ldns"
# Pager program similar to more
brew "less"
# Sophisticated file transfer program
brew "lftp"
# Asynchronous event library
brew "libev"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# JIT library for the GNU compiler collection
brew "libgccjit"
# C and C++ client library to the memcached server
brew "libmemcached"
# Library for MPD in the C, C++, and Objective-C languages
brew "libmpdclient"
# C library for the Public Suffix List
brew "libpsl"
# HTTP client/server library for GNOME
brew "libsoup"
# Library for SVG files
brew "libsvg"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# GNOME XML library
brew "libxml2"
# Access large language models from the command-line
brew "llm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Scalable distributed version control system
brew "mercurial"
# Uniform interface to a large number of hash algorithms
brew "mhash"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Run a Kubernetes cluster locally
brew "minikube"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Improved JPEG encoder
brew "mozjpeg"
# Multiple Repository management tool
brew "mr"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@22"
# Package for scientific computing with Python
brew "numpy"
# Create, run, and share large language models (LLMs)
brew "ollama"
# H.264 codec from Cisco
brew "openh264"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# OCI Registry As Storage
brew "oras"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# Log analyzer for PostgreSQL
brew "pgbadger"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Paste PNG into files
brew "pngpaste"
# PNG image optimizing utility
brew "pngquant"
# Tool for managing OCI containers and pods
brew "podman"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Software environment for statistical computing
brew "r"
# C AMQP client library for RabbitMQ
brew "rabbitmq-c"
# JSON parser/generator for C++ with SAX and DOM style APIs
brew "rapidjson"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Generate passwords using SecurityFoundation framework
brew "sf-pwgen"
# Work with remote images registries
brew "skopeo"
# CLI utility for manipulating SQLite databases
brew "sqlite-utils"
# Use SQL to instantly query your cloud services
brew "steampipe"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Version control system designed to be a better CVS
brew "subversion"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Kubernetes-native framework for test definition and execution
brew "testkube"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Convert TeXinfo files to HTML
brew "texi2html"
# Free software distribution for the TeX typesetting system
brew "texlive"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Ultimate terminal divider powered by tmux
brew "tmux-xpanes"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Find and verify credentials
brew "trufflehog"
# Command-line tool for URL parsing and manipulation
brew "trurl"
# Language for application scale JavaScript development
brew "typescript"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Compiler for the GObject type system
brew "vala"
# Config manager based on git
brew "vcsh"
# HTTP load testing tool and library
brew "vegeta"
# Modern watch command
brew "viddy"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Universal WebAssembly Runtime
brew "wasmer"
# Standalone JIT-style runtime for WebAssembly, using Cranelift
brew "wasmtime"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line tool to help build, run, and test web extensions
brew "web-ext"
# Webserver benchmarking tool that supports multithreading
brew "weighttp"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Interactive viewer for graphs written in Graphviz's dot language
brew "xdot"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# XML command-line utilities
brew "xmlstarlet"
# Fast CSV toolkit written in Rust
brew "xsv"
# Yet Another JSON Library
brew "yajl"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# Seamless ssh-agent for YubiKeys and other PIV tokens
brew "yubikey-agent", restart_service: :changed
# Suite of barcodes-reading tools
brew "zbar"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Compression and file packaging/archive utility
brew "zip"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# A command-line tool to read and modify JSON, Plist, YAML and XML files
brew "abridoux/formulae/scout"
# A vulnerability scanner for container images and filesystems
brew "anchore/grype/grype"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# eks-node-viewer is a tool for visualizing dynamic node usage within an EKS cluster.
brew "aws/tap/eks-node-viewer"
# The easy button for learning, testing and demoing Amazon EKS
brew "aws/tap/eksdemo"
# Debug your pod by a new container with every troubleshooting tools pre-installed
brew "aylei/tap/kubectl-debug"
# Streaming replication for SQLite
brew "benbjohnson/litestream/litestream"
# Inspect, visualize, and transform GraphQL schemas on the command line.
brew "benweint/gquil/gquil"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Generate Terraform moved blocks automatically for painless refactoring
brew "busser/tap/tfautomv"
# AI on the command line
brew "charmbracelet/tap/mods"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# Creates CycloneDX Software Bill of Materials (SBOM) from Go modules
brew "cyclonedx/cyclonedx/cyclonedx-gomod"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-native-comp", "with-savchenkovaleriy-big-sur-icon"]
# The kubectx for operators.
brew "danielfoehrkn/switch/switch"
# The worlds fastest and most scalable OpenAPI linter
brew "daveshanley/vacuum/vacuum"
# A CLI for interacting with the Fastly platform
brew "fastly/tap/fastly"
brew "gabotechs/taps/dep-tree"
# Backrest is a web UI and orchestrator for restic backup.
brew "garethgeorge/backrest-tap/backrest"
# A mutation testing tool for Go.
brew "go-gremlins/tap/gremlins"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Release engineering, simplified
brew "goreleaser/tap/goreleaser"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Vault
brew "hashicorp/tap/vault"
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
# Generate an IAM policy from AWS, Azure, or Google Cloud (GCP) calls using client-side monitoring (CSM) or embedded proxy.
brew "iann0036/iamlive/iamlive"
# A CLI tool that masks and obscurates your environment variables for demos
brew "im2nguyen/envo/envo"
# Self documenting task runner
brew "joerdav/xc/xc"
# brewfile-desc add descriptions of formulae to Brewfile.
brew "k1low/tap/brewfile-desc"
# KCL Command Line Interface
brew "kcl-lang/tap/kcl"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
brew "kubeshop/tracetest/tracetest"
# Easily and quickly convert audio to text
brew "llimllib/whisper/blisper"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Terminal-based presentations using Pandoc
brew "nicholasdille/tap/patat-bin"
# Feature rich terminal pager
brew "noborus/tap/ov"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# Run Anything
brew "pkgxdev/made/pkgx"
# Execute your runbooks, docs, and READMEs.
brew "stateful/tap/runme"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Change the theme of your terminal, text editor and anything else with one command.
brew "tinted-theming/tinted/tinty"
# Fast, multipurpose tool for AWS CloudWatch Logs
brew "tylerbrock/saw/saw"
# jq for binary formats
brew "wader/tap/fq"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Command-line interface for 1Password
cask "1password-cli"
# Password manager
cask "1password@nightly"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Web browser
cask "alex313031-thorium"
# Application launcher and productivity software
cask "alfred@4"
# GraphQL client
cask "altair-graphql-client"
# iOS App Store alternative
cask "altserver"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Android SDK component
cask "android-platform-tools"
# Redis desktop manager
cask "another-redis-desktop-manager"
# User-friendly GUI app for Homebrew
cask "applite"
# Tool for digging into binary files
cask "archaeology"
# Install and configure AutoPkg
cask "autopkgr"
# Menu bar icon organiser
cask "bartender"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Screen saver based on animations presented during Apple Special Event Brooklyn
cask "brooklyn"
# Utility that prevents the system from going to sleep
cask "caffeine"
# E-books management software
cask "calibre"
# Control USB Cameras from an app
cask "cameracontroller"
# Web debugging Proxy application
cask "charles"
# Open links in any browser
cask "choosy"
# Column-oriented database management system
cask "clickhouse"
# Allows switching between application windows
cask "contexts"
# Serial port terminal
cask "coolterm"
# Disk space visualiser
cask "daisydisk"
# API documentation browser and code snippet manager
cask "dash"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Virtual monitor for screen sharing
cask "deskpad"
# Display calibration and characterization powered by ArgyllCMS
cask "displaycal"
# App to build and share containerised applications and microservices
cask "docker"
# PCB design tool
cask "easyeda"
# Sci-fi themed terminal emulator and system monitor
cask "edex-ui"
# Matrix collaboration client
cask "element"
# Menu bar utility for Elgato Thunderbolt docks
cask "elgato-thunderbolt-dock"
# Google Chromium, sans integration with Google
cask "eloston-chromium"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "font-hasklig"
cask "font-monaspace"
cask "font-playwrite-fr-moderne"
cask "font-playwrite-fr-trad"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Virtual COM port driver
cask "ftdi-vcp-driver"
# Open-source platform for visualizing and manipulating large graphs
cask "gephi"
# Tool to create GIFs from videos
cask "gifrocket"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# GitHub notifications on your menu bar
cask "gitify"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# IDE for exploring GraphQL APIs
cask "graphql-ide"
# Adds an OpenGL renderer to the ZDoom source port
cask "gzdoom"
# Menu Bar app to perform common Home Assistant functions
cask "ha-menu"
# UI for Kubernetes
cask "headlamp"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# First person shooter engine
cask "ioquake3"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2@beta"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Electronics design automation suite
cask "kicad"
# Modular community keyboard firmware
cask "kiibohd-configurator"
# Visual user interface for Docker Container management
cask "kitematic"
# GPU-based terminal emulator
cask "kitty"
# Desktop reader for Kobo eBooks
cask "kobo"
# Free and open-source painting and sketching program
cask "krita"
# Preference pane to manage Homebrew-installed services
cask "launchrocket"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Magic auto brightness based on screen contents
cask "lumen"
# Adaptive brightness for external displays
cask "lunar"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge@beta"
# Utility that automatically downloads firmwares and installers
cask "mist"
# CSV editor
cask "modern-csv"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# All-in-one calendars, tasks and scheduler
cask "morgen"
# Media player
cask "mplayerx"
# TouchBar customization app
cask "mtmr"
# Music app blocker utility
cask "music-decoy"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
cask "nativedisplaybrightness"
# Neovim Client
cask "neovide"
# Desktop application
cask "nofwl"
# Open-source software for live streaming and screen recording
cask "obs"
cask "obs-virtualcam"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# GitLab mirror - Graphical OpenConnect client (beta phase)
cask "openconnect-gui"
# Retro video game emulation
cask "openemu@experimental"
# Replacement for Docker Desktop
cask "orbstack"
# Extract files and folders from package files, disk images, and archives
cask "pacifist"
# Window and app manager scriptable with JavaScript
cask "phoenix"
# Colour picker for colours onscreen
cask "pika"
# Home media player
cask "plex-media-player"
# Music player focusing on visuals
cask "plexamp"
# Utility to display the Dock in the Touch Bar
cask "pock"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Quick Look plugin for mobile apps and provisioning profiles
cask "provisionql"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# SQL query tool and SQL editor
cask "razorsql"
# Digital audio production application
cask "reaper"
# Analysis tool for security research and malware triage
cask "red-canary-mac-monitor"
# Data science software focusing on R and Python
cask "rstudio-preview"
# Store SSH keys in the Secure Enclave
cask "secretive"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# App that enables mouse-free UI interaction
cask "shortcat"
# Colour blindness simulator for videos and images
cask "sim-daltonism"
# Digital design and prototyping platform
cask "sketch"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Windows manager
cask "stay"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Desktop application for viewing and analyzing tabular data
cask "tad"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Tescontainers desktop application for local testing and development
cask "testcontainers-desktop"
# Browse the contents of archives
cask "the-archive-browser"
# Unpacks archive files
cask "the-unarchiver"
# Run commands and display their output on the desktop
cask "ubersicht"
# USB and Bluetooth device driver
cask "usb-overdrive"
# Virtual machines UI using QEMU
cask "utm"
# GUI for the Neovim text editor
cask "vimr"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Web browser
cask "waterfox"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# REST, GraphQL and gRPC client
cask "yaak"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Open-source markdown editor
cask "zettlr"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Airmail", id: 918858936
mas "AmorphousMemoryMark", id: 1495719766
mas "Apple Configurator", id: 1037126344
mas "Blackmagic Disk Speed Test", id: 425264550
mas "CleanMyDrive 2", id: 523620159
mas "Discovery", id: 1381004916
mas "Explain Everything", id: 1020339980
mas "Fenêtre", id: 1286743037
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "Home Assistant", id: 1099568401
mas "Hush", id: 1544743900
mas "iMazing Profile Editor", id: 1487860882
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Leaf", id: 576338668
mas "Levelator", id: 1493326487
mas "Looks Like Rain", id: 6443960587
mas "NDIScanConverter", id: 1084051465
mas "Next Meeting", id: 1017470484
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Screens 5", id: 1663047912
mas "ShellFish", id: 1336634154
mas "Strongbox", id: 897283731
mas "Swift Playground", id: 1496833156
mas "TestFlight", id: 899247664
mas "The Clock", id: 488764545
mas "Tweetbot", id: 1384080005
mas "Unread", id: 1363637349
mas "WiFi Signal", id: 525912054
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "alefragnani.project-manager"
vscode "antfu.browse-lite"
vscode "antfu.iconify"
vscode "antfu.vite"
vscode "asvetliakov.vscode-neovim"
vscode "barankilic.beamer"
vscode "bat67.latex-extension-pack"
vscode "bazelbuild.vscode-bazel"
vscode "bierner.docs-view"
vscode "bierner.github-markdown-preview"
vscode "bierner.lit-html"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "brody715.txtar"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "colton.inline-html"
vscode "csstools.postcss"
vscode "dmitry-korobchenko.prototxt"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "drcika.apc-extension"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "elves.elvish"
vscode "esbenp.prettier-vscode"
vscode "fastly.vscode-fastly-vcl"
vscode "fill-labs.dependi"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fredrikbakke.agda-syntax"
vscode "fterrag.vscode-php-cs-fixer"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.wireit"
vscode "grafana.vscode-jsonnet"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "jakebathman.mysql-syntax"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-csv-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-lisp-syntax"
vscode "jeff-hykin.better-prolog-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jinliming2.vscode-go-template"
vscode "jnoortheen.nix-ide"
vscode "joaompinto.vscode-graphviz"
vscode "jscearcy.rust-doc-viewer"
vscode "ldez.ignore-files"
vscode "lextudio.restructuredtext"
vscode "lokalise.i18n-ally"
vscode "maelvalais.autoconf"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "mrmlnc.vscode-attrs-sorter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-sarifvscode.sarif-viewer"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "nefrob.vscode-just-syntax"
vscode "plex.vscode-regolint"
vscode "pomdtr.excalidraw-editor"
vscode "privy.privy-vscode"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "redcmd.tmlanguage-syntax-highlighter"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sidneys1.gitconfig"
vscode "stateful.runme"
vscode "steoates.autoimport"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "thomanq.math-snippets"
vscode "timonwong.shellcheck"
vscode "tintedtheming.base16-tinted-themes"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tooltitudeteam.tooltitude"
vscode "torn4dom4n.latex-support"
vscode "trond-snekvik.simple-rst"
vscode "tsandall.opa"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "valentjn.vscode-ltex"
vscode "voorjaar.windicss-intellisense"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "wizcloud.wiz-vscode"
vscode "wscats.vue"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zenghongtu.vscode-asciiflow2"
vscode "zerotaskx.rust-extension-pack"
vscode "ziyasal.vscode-open-in-github"
vscode "zxh404.vscode-proto3"
